Revit 2027 API
FabricRoundingManager.TotalLengthRoundingMethod Property
 Identifies the total length rounding method
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoundingMethod TotalLengthRoundingMethod { get; set; }
Public Property TotalLengthRoundingMethod As RoundingMethod
	Get
	Set
public:
property RoundingMethod TotalLengthRoundingMethod {
	RoundingMethod get ();
	void set (RoundingMethod value);
}
member TotalLengthRoundingMethod : RoundingMethod with get, set
Property Value
RoundingMethod
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  When setting this property: IsActiveOnElement property is false.
See Also
Reference
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace